## repositories plan
```
data.github_team.operations_engineering_test: Reading...
data.github_team.test_team_access: Reading...
module.ministryofjustice-test.module.test-repo-levg.github_repository.default: Refreshing state... [id=test-repo-levg]
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_repository.default: Refreshing state... [id=test-tamf-repo-test-org]
data.github_team.operations_engineering: Reading...
module.ministryofjustice.module.operations-engineering-metadata-poc.github_repository.default: Refreshing state... [id=operations-engineering-metadata-poc]
module.ministryofjustice.module.cloud-platform-maintenance-pages.github_repository.default: Refreshing state... [id=cloud-platform-maintenance-pages]
module.ministryofjustice.module.operations-engineering.github_repository.default: Refreshing state... [id=operations-engineering]
module.ministryofjustice.module.operations-engineering-runbooks.github_repository.default: Refreshing state... [id=operations-engineering-runbooks]
module.ministryofjustice.module.github-collaborators.github_repository.default: Refreshing state... [id=github-collaborators]
data.github_team.operations_engineering_test: Read complete after 1s [id=9456244]
module.ministryofjustice.module.terraform-aws-mtasts.github_repository.default: Refreshing state... [id=terraform-aws-mtasts]
module.ministryofjustice.module.operations-engineering-join-github.github_repository.default: Refreshing state... [id=operations-engineering-join-github]
module.ministryofjustice.module.moj-terraform-scim-github.github_repository.default: Refreshing state... [id=moj-terraform-scim-github]
data.github_team.test_team_access: Read complete after 1s [id=9472191]
module.ministryofjustice.module.tech-docs-github-pages-publisher.github_repository.default: Refreshing state... [id=tech-docs-github-pages-publisher]
module.ministryofjustice.module.template-repository.github_repository.default: Refreshing state... [id=template-repository]
module.ministryofjustice.module.technical-guidance.github_repository.default: Refreshing state... [id=technical-guidance]
module.ministryofjustice.module.terraform-github-repository.github_repository.default: Refreshing state... [id=terraform-github-repository]
module.ministryofjustice.module.operations-engineering-reports.github_repository.default: Refreshing state... [id=operations-engineering-reports]
data.github_team.operations_engineering: Read complete after 4s [id=4192115]
module.ministryofjustice.module.terraform-template-poc.github_repository.default: Refreshing state... [id=terraform-template-poc]
module.ministryofjustice.module.acronyms.github_repository.default: Refreshing state... [id=acronyms]
module.ministryofjustice.module.operations-engineering-devcontainer.github_repository.default: Refreshing state... [id=operations-engineering-devcontainer]
module.ministryofjustice.module.tech-docs-monitor.github_repository.default: Refreshing state... [id=tech-docs-monitor]
module.ministryofjustice.module.operations-engineering-support-metadata.github_repository.default: Refreshing state... [id=operations-engineering-support-metadata]
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_repository.default: Refreshing state... [id=operations-engineering-documentation-browser-extension]
module.ministryofjustice.module.operations-engineering-dns-spike.github_repository.default: Refreshing state... [id=operations-engineering-dns-spike]
module.ministryofjustice.module.moj-terraform-aws-sso.github_repository.default: Refreshing state... [id=moj-terraform-aws-sso]
module.ministryofjustice.module.operations-engineering-kpi-dashboard-poc.github_repository.default: Refreshing state... [id=operations-engineering-kpi-dashboard-poc]
module.ministryofjustice.module.github.github_repository.default: Refreshing state... [id=.github]
module.ministryofjustice.module.operations-engineering-example.github_repository.default: Refreshing state... [id=operations-engineering-example]
module.ministryofjustice.module.test_tamf_repo_2.github_repository.default: Refreshing state... [id=test-tamf-repo-2]
module.ministryofjustice.module.template-documentation-site.github_repository.default: Refreshing state... [id=template-documentation-site]
module.ministryofjustice.module.operations-engineering-certificate-renewal.github_repository.default: Refreshing state... [id=operations-engineering-certificate-renewal]
module.ministryofjustice.module.operations-engineering-user-guide.github_repository.default: Refreshing state... [id=operations-engineering-user-guide]
module.ministryofjustice.module.github-actions.github_repository.default: Refreshing state... [id=github-actions]
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_repository_tag_protection.default: Refreshing state... [id=170153]
module.ministryofjustice-test.module.test_tamf_repo_test_org.data.github_actions_public_key.default: Reading...
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLRPf2c4Cyrgo]
module.ministryofjustice-test.module.test_tamf_repo_test_org.data.github_actions_public_key.default: Read complete after 0s [id=3380204578043523366]
module.ministryofjustice-test.module.test-repo-levg.github_repository_tag_protection.default: Refreshing state... [id=168994]
module.ministryofjustice-test.module.test-repo-levg.data.github_actions_public_key.default: Reading...
module.ministryofjustice-test.module.test-repo-levg.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLPRAVc4CyGYH]
module.ministryofjustice.module.cloud-platform-maintenance-pages.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.cloud-platform-maintenance-pages.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEeVbDs4CwGth]
module.ministryofjustice-test.module.test-repo-levg.data.github_actions_public_key.default: Read complete after 1s [id=3380204578043523366]
module.ministryofjustice.module.cloud-platform-maintenance-pages.github_repository_tag_protection.default: Refreshing state... [id=164899]
module.ministryofjustice.module.operations-engineering-metadata-poc.github_repository_tag_protection.default: Refreshing state... [id=165174]
module.ministryofjustice.module.operations-engineering-metadata-poc.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-metadata-poc.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKeC3Jc4CwPGL]
module.ministryofjustice.module.operations-engineering-metadata-poc.github_actions_variable.default["DEVELOPMENT_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-metadata-poc:DEVELOPMENT_ECR_REPOSITORY]
module.ministryofjustice.module.cloud-platform-maintenance-pages.data.github_actions_public_key.default: Read complete after 0s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-metadata-poc.github_actions_variable.default["ECR_REGISTRY"]: Refreshing state... [id=operations-engineering-metadata-poc:ECR_REGISTRY]
module.ministryofjustice.module.operations-engineering-metadata-poc.github_actions_variable.default["DEVELOPMENT_ECR_REGION"]: Refreshing state... [id=operations-engineering-metadata-poc:DEVELOPMENT_ECR_REGION]
module.ministryofjustice.module.terraform-aws-mtasts.github_branch_protection.default: Refreshing state... [id=BPR_kwDOHWUugs4CwPiH]
module.ministryofjustice.module.terraform-aws-mtasts.github_repository_tag_protection.default: Refreshing state... [id=165192]
module.ministryofjustice.module.operations-engineering-metadata-poc.data.github_actions_public_key.default: Read complete after 2s [id=3380204578043523366]
module.ministryofjustice.module.terraform-aws-mtasts.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.github-collaborators.github_repository_tag_protection.default: Refreshing state... [id=164898]
module.ministryofjustice.module.github-collaborators.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.github-collaborators.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEoQScc4CwGtd]
module.ministryofjustice.module.operations-engineering.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering.github_branch_protection.default: Refreshing state... [id=BPR_kwDODVCV0c4CwPYY]
module.ministryofjustice.module.operations-engineering.github_repository_tag_protection.default: Refreshing state... [id=165184]
module.ministryofjustice.module.operations-engineering-runbooks.github_repository_tag_protection.default: Refreshing state... [id=165175]
module.ministryofjustice.module.operations-engineering-runbooks.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKK8OCc4CwPGM]
module.ministryofjustice.module.operations-engineering-runbooks.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.terraform-aws-mtasts.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-join-github.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-join-github.github_repository_tag_protection.default: Refreshing state... [id=165170]
module.ministryofjustice.module.github-collaborators.data.github_actions_public_key.default: Read complete after 2s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-join-github.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKeC4ns4CwPGB]
module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["DEV_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-join-github:DEV_ECR_REPOSITORY]
module.ministryofjustice.module.operations-engineering.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["DEV_ECR_REGION"]: Refreshing state... [id=operations-engineering-join-github:DEV_ECR_REGION]
module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["DEV_ECR_REGISTRY"]: Refreshing state... [id=operations-engineering-join-github:DEV_ECR_REGISTRY]
module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["PROD_ECR_REGISTRY"]: Refreshing state... [id=operations-engineering-join-github:PROD_ECR_REGISTRY]
module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["PROD_ECR_REGION"]: Refreshing state... [id=operations-engineering-join-github:PROD_ECR_REGION]
module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["PROD_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-join-github:PROD_ECR_REPOSITORY]
module.ministryofjustice.module.operations-engineering-runbooks.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.moj-terraform-scim-github.github_repository_tag_protection.default: Refreshing state... [id=164897]
module.ministryofjustice.module.operations-engineering-join-github.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.moj-terraform-scim-github.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.moj-terraform-scim-github.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEoPJ8s4CwGtf]
module.ministryofjustice.module.tech-docs-github-pages-publisher.github_repository_tag_protection.default: Refreshing state... [id=165187]
module.ministryofjustice.module.tech-docs-github-pages-publisher.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.tech-docs-github-pages-publisher.github_branch_protection.default: Refreshing state... [id=BPR_kwDOE7RAx84CwPh_]
module.ministryofjustice.module.template-repository.github_branch_protection.default: Refreshing state... [id=BPR_kwDODYkhA84CwPiC]
module.ministryofjustice.module.template-repository.github_repository_tag_protection.default: Refreshing state... [id=165191]
module.ministryofjustice.module.template-repository.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.terraform-github-repository.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLELUgs4CwzoY]
module.ministryofjustice.module.terraform-github-repository.github_repository_tag_protection.default: Refreshing state... [id=166200]
module.ministryofjustice.module.moj-terraform-scim-github.data.github_actions_public_key.default: Read complete after 2s [id=3380204578043523366]
module.ministryofjustice.module.terraform-github-repository.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-reports.github_repository_tag_protection.default: Refreshing state... [id=165169]
module.ministryofjustice.module.operations-engineering-reports.github_actions_variable.default["PRODUCTION_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-reports:PRODUCTION_ECR_REPOSITORY]
module.ministryofjustice.module.tech-docs-github-pages-publisher.data.github_actions_public_key.default: Read complete after 2s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-reports.github_actions_variable.default["DEVELOPMENT_ECR_REGION"]: Refreshing state... [id=operations-engineering-reports:DEVELOPMENT_ECR_REGION]
module.ministryofjustice.module.operations-engineering-reports.github_actions_variable.default["DEVELOPMENT_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-reports:DEVELOPMENT_ECR_REPOSITORY]
module.ministryofjustice.module.operations-engineering-reports.github_actions_variable.default["PRODUCTION_ECR_REGION"]: Refreshing state... [id=operations-engineering-reports:PRODUCTION_ECR_REGION]
module.ministryofjustice.module.operations-engineering-reports.github_actions_variable.default["ECR_REGISTRY"]: Refreshing state... [id=operations-engineering-reports:ECR_REGISTRY]
module.ministryofjustice.module.template-repository.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-reports.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-reports.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEpRCis4CwPF-]
module.ministryofjustice.module.terraform-template-poc.github_repository_tag_protection.default: Refreshing state... [id=165190]
module.ministryofjustice.module.terraform-github-repository.data.github_actions_public_key.default: Read complete after 6s [id=3380204578043523366]
module.ministryofjustice.module.terraform-template-poc.github_branch_protection.default: Refreshing state... [id=BPR_kwDOJKjnDs4CwPiD]
module.ministryofjustice.module.terraform-template-poc.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.technical-guidance.github_branch_protection.default: Refreshing state... [id=BPR_kwDOBeUD0s4CwPiB]
module.ministryofjustice.module.technical-guidance.github_repository_tag_protection.default: Refreshing state... [id=165189]
module.ministryofjustice.module.technical-guidance.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.moj-terraform-aws-sso.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.moj-terraform-aws-sso.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEYOl7c4CwGtj]
module.ministryofjustice.module.operations-engineering-reports.data.github_actions_public_key.default: Read complete after 2s [id=3380204578043523366]
module.ministryofjustice.module.moj-terraform-aws-sso.github_repository_tag_protection.default: Refreshing state... [id=164896]
module.ministryofjustice.module.operations-engineering-devcontainer.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-devcontainer.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLCkQts4Cv-3X]
module.ministryofjustice.module.operations-engineering-devcontainer.github_repository_tag_protection.default: Refreshing state... [id=164706]
module.ministryofjustice.module.terraform-template-poc.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.ministryofjustice.module.tech-docs-monitor.github_branch_protection.default: Refreshing state... [id=BPR_kwDOHQFa_s4CwPiA]
module.ministryofjustice.module.tech-docs-monitor.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.tech-docs-monitor.github_repository_tag_protection.default: Refreshing state... [id=165188]
module.ministryofjustice.module.technical-guidance.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-support-metadata.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.moj-terraform-aws-sso.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-support-metadata.github_repository_tag_protection.default: Refreshing state... [id=172607]
module.ministryofjustice.module.operations-engineering-support-metadata.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLWBtds4Cz8XQ]
module.ministryofjustice.module.github.github_repository_tag_protection.default: Refreshing state... [id=164900]
module.ministryofjustice.module.operations-engineering-devcontainer.data.github_actions_public_key.default: Read complete after 6s [id=3380204578043523366]
module.ministryofjustice.module.github.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.github.github_branch_protection.default: Refreshing state... [id=BPR_kwDOFbeyoM4CwGtg]
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_branch_protection.default: Refreshing state... [id=BPR_kwDOK636CM4CwPF8]
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.tech-docs-monitor.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_repository_tag_protection.default: Refreshing state... [id=165168]
module.ministryofjustice.module.operations-engineering-dns-spike.github_branch_protection.default: Refreshing state... [id=BPR_kwDOL4z9984C-v0W]
module.ministryofjustice.module.operations-engineering-support-metadata.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-dns-spike.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-dns-spike.github_repository_tag_protection.default: Refreshing state... [id=190393]
module.ministryofjustice.module.acronyms.github_repository_tag_protection.default: Refreshing state... [id=164902]
module.ministryofjustice.module.acronyms.github_branch_protection.default: Refreshing state... [id=BPR_kwDODR2mI84CwGtl]
module.ministryofjustice.module.github.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.acronyms.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-kpi-dashboard-poc.github_branch_protection.default: Refreshing state... [id=BPR_kwDOL1tpxs4C9zwq]
module.ministryofjustice.module.operations-engineering-kpi-dashboard-poc.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-kpi-dashboard-poc.github_repository_tag_protection.default: Refreshing state... [id=188783]
module.ministryofjustice.module.operations-engineering-example.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-example.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKnX9OM4CwPGH]
module.ministryofjustice.module.operations-engineering-dns-spike.data.github_actions_public_key.default: Read complete after 6s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-example.github_repository_tag_protection.default: Refreshing state... [id=165173]
module.ministryofjustice.module.operations-engineering-example.github_actions_variable.default["DEVELOPMENT_ECR_REGION"]: Refreshing state... [id=operations-engineering-example:DEVELOPMENT_ECR_REGION]
module.ministryofjustice.module.operations-engineering-example.github_actions_variable.default["PRODUCTION_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-example:PRODUCTION_ECR_REPOSITORY]
module.ministryofjustice.module.operations-engineering-example.github_actions_variable.default["DEVELOPMENT_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-example:DEVELOPMENT_ECR_REPOSITORY]
module.ministryofjustice.module.acronyms.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-example.github_actions_variable.default["PRODUCTION_ECR_REGION"]: Refreshing state... [id=operations-engineering-example:PRODUCTION_ECR_REGION]
module.ministryofjustice.module.test_tamf_repo_2.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-kpi-dashboard-poc.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.test_tamf_repo_2.github_repository_tag_protection.default: Refreshing state... [id=170152]
module.ministryofjustice.module.test_tamf_repo_2.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLRPf1s4Cyrgn]
module.ministryofjustice.module.operations-engineering-example.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-certificate-renewal.github_repository_tag_protection.default: Refreshing state... [id=165171]
module.ministryofjustice.module.operations-engineering-certificate-renewal.github_branch_protection.default: Refreshing state... [id=BPR_kwDOI-Hjhc4CwPF_]
module.ministryofjustice.module.operations-engineering-certificate-renewal.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.template-documentation-site.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEQGgTs4CwPiI]
module.ministryofjustice.module.template-documentation-site.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.template-documentation-site.github_repository_tag_protection.default: Refreshing state... [id=165193]
module.ministryofjustice.module.operations-engineering-user-guide.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKCGhm84CwPGO]
module.ministryofjustice.module.test_tamf_repo_2.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-user-guide.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-user-guide.github_repository_tag_protection.default: Refreshing state... [id=165176]
module.ministryofjustice.module.github-actions.github_repository_tag_protection.default: Refreshing state... [id=164901]
module.ministryofjustice.module.github-actions.github_branch_protection.default: Refreshing state... [id=BPR_kwDODNFKOs4CwGtk]
module.ministryofjustice.module.github-actions.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-certificate-renewal.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_team_repository.maintain["9456244"]: Refreshing state... [id=9456244:test-tamf-repo-test-org]
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_team_repository.push["9472191"]: Refreshing state... [id=9472191:test-tamf-repo-test-org]
module.ministryofjustice.module.github-actions.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:github-actions]
module.ministryofjustice.module.template-documentation-site.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.github.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:.github]
module.ministryofjustice.module.tech-docs-monitor.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:tech-docs-monitor]
module.ministryofjustice.module.operations-engineering-dns-spike.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-dns-spike]
module.ministryofjustice.module.operations-engineering-kpi-dashboard-poc.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-kpi-dashboard-poc]
module.ministryofjustice.module.operations-engineering-user-guide.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-join-github.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-join-github]
module.ministryofjustice.module.operations-engineering.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering]
module.ministryofjustice.module.operations-engineering-example.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-example]
module.ministryofjustice.module.terraform-github-repository.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:terraform-github-repository]
module.ministryofjustice.module.github-actions.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-certificate-renewal.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-certificate-renewal]
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-documentation-browser-extension]
module.ministryofjustice.module.tech-docs-github-pages-publisher.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:tech-docs-github-pages-publisher]
module.ministryofjustice.module.operations-engineering-devcontainer.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-devcontainer]
module.ministryofjustice.module.cloud-platform-maintenance-pages.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:cloud-platform-maintenance-pages]
module.ministryofjustice.module.operations-engineering-metadata-poc.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-metadata-poc]
module.ministryofjustice.module.github-collaborators.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:github-collaborators]
module.ministryofjustice.module.operations-engineering-runbooks.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-runbooks]
module.ministryofjustice.module.test_tamf_repo_2.github_team_repository.maintain["4192115"]: Refreshing state... [id=4192115:test-tamf-repo-2]
module.ministryofjustice.module.technical-guidance.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:technical-guidance]
module.ministryofjustice.module.moj-terraform-aws-sso.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:moj-terraform-aws-sso]
module.ministryofjustice.module.template-documentation-site.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:template-documentation-site]
module.ministryofjustice.module.acronyms.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:acronyms]
module.ministryofjustice.module.template-repository.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:template-repository]
module.ministryofjustice.module.operations-engineering-user-guide.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-user-guide]
module.ministryofjustice.module.terraform-aws-mtasts.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:terraform-aws-mtasts]
module.ministryofjustice.module.terraform-template-poc.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:terraform-template-poc]
module.ministryofjustice.module.operations-engineering-support-metadata.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-support-metadata]
module.ministryofjustice.module.operations-engineering-reports.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-reports]
module.ministryofjustice.module.moj-terraform-scim-github.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:moj-terraform-scim-github]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.ministryofjustice.module.operations-engineering-dns-form.data.github_actions_public_key.default will be read during apply
  # (config refers to values not yet known)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = (known after apply)
    }

  # module.ministryofjustice.module.operations-engineering-dns-form.github_branch_protection.default will be created
  + resource "github_branch_protection" "default" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + strict = false
        }
    }

  # module.ministryofjustice.module.operations-engineering-dns-form.github_repository.default will be created
  + resource "github_repository" "default" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "A web form that captures the requirements for a DNS change • This repository is defined and managed in Terraform"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_discussions             = false
      + has_downloads               = true
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "operations-engineering-dns-form"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "operations-engineering",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis {
          + secret_scanning {
              + status = "enabled"
            }
          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }

      + template {
          + include_all_branches = false
          + owner                = "ministryofjustice"
          + repository           = "template-repository"
        }
    }

  # module.ministryofjustice.module.operations-engineering-dns-form.github_repository_tag_protection.default will be created
  + resource "github_repository_tag_protection" "default" {
      + id                = (known after apply)
      + pattern           = "*"
      + repository        = (known after apply)
      + tag_protection_id = (known after apply)
    }

  # module.ministryofjustice.module.operations-engineering-dns-form.github_team_repository.admin["4192115"] will be created
  + resource "github_team_repository" "admin" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "operations-engineering-dns-form"
      + team_id    = "4192115"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```